app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
  def index
    @blogs = Blog.all