app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all.order(created_at: :desc)
    @users = User.all
---
SELECT `users`.* FROM `users`

  def show
    @blog = Blog.find_by(id: params[:id])
    @user = User.find_by(id: @blog.uid)
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 10 LIMIT 1  [["id", 10], ["LIMIT", 1]]
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @blog = Blog.new(blog_params)
    @blog.uid = current_user.id

    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`title`, `content`, `created_at`, `updated_at`, `uid`, `image`) VALUES ('どうも大谷翔平です。これからよろしくお願いします。', 'どうも大谷翔平です。これからよろしくお願いします。どうも大谷翔平です。これからよろしくお願いします。どうも大谷翔平です。これからよろしくお願いします。どうも大谷翔平です。これからよろしくお願いします。どうも大谷翔平です。これからよろしくお願いします。', '2019-10-24 10:40:49.946110', '2019-10-24 10:40:49.946110', 16, 'スクリーンショット_2019-10-07_19.26.12.png')

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE `blogs` SET `blogs`.`content` = '今日はOOカントリーでゴルフ今日はOOカントリーでゴルフ今日はOO', `blogs`.`updated_at` = '2019-10-15 16:37:42.396891' WHERE `blogs`.`id` = 11

  def destroy
    @blog.destroy
---
DELETE FROM `blogs` WHERE `blogs`.`id` = 1

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 10 LIMIT 1