app/controllers/homes_controller.rb

  def guest_sign_in
    user = User.find_or_create_by(email: 'test@gmail.com') do |user|
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@gmail.com' LIMIT 1