app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
    @blog = Blog.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` IS NULL LIMIT 1

  def list
    @users = User.all
---
SELECT `users`.* FROM `users`