app/models/blog.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 16 LIMIT 1
---
  def user
    User.find_by(id: uid)