app/models/user.rb

  def self.find_for_oauth(auth)
    user = User.where(uid: auth.uid, provider: auth.provider).first
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = '2386827411580261' AND `users`.`provider` = 'facebook' ORDER BY `users`.`id` ASC LIMIT 1